src/InformationRegisters/ИсполнителиПоПроектам/ИсполнителиПоПроектам.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ИсполнителиПоПроектам</name>
  <resources>
    <name>Приоритет</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Проект</name>
    <type>
      <types>CatalogRef.ПроектыКораблей</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Исполнитель</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

src/InformationRegisters/ИсполнителиПоПроектам/ManagerModule.bsl
///////////////////////////////////////////////
// ЭКСПОРТНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ

Функция ПолучитьИсполнителей(Проекты) Экспорт
	Запрос 			= Новый Запрос;
	Запрос.Текст 	= "ВЫБРАТЬ
	             	  |	ИсполнителиПоПроектам.Исполнитель КАК Исполнитель,
	             	  |	ИсполнителиПоПроектам.Приоритет КАК Приоритет
	             	  |ИЗ
	             	  |	РегистрСведений.ИсполнителиПоПроектам КАК ИсполнителиПоПроектам
	             	  |ГДЕ
	             	  |	ИсполнителиПоПроектам.Проект В(&Проекты)
	             	  |
	             	  |УПОРЯДОЧИТЬ ПО
	             	  |	Приоритет УБЫВ";
	Запрос.УстановитьПараметр("Проекты", Проекты);
	Возврат Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Исполнитель");
КонецФункции // ПолучитьИсполнителей

Функция ПолучитьИсполнителя(Проект) Экспорт
	Результат		= Неопределено;
	Запрос 			= Новый Запрос;
	Запрос.Текст 	= "ВЫБРАТЬ
	             	  |	ИсполнителиПоПроектам.Исполнитель КАК Исполнитель,
	             	  |	ИсполнителиПоПроектам.Приоритет КАК Приоритет
	             	  |ИЗ
	             	  |	РегистрСведений.ИсполнителиПоПроектам КАК ИсполнителиПоПроектам
	             	  |ГДЕ
	             	  |	ИсполнителиПоПроектам.Проект = &Проект
	             	  |
	             	  |УПОРЯДОЧИТЬ ПО
	             	  |	Приоритет УБЫВ";
	Запрос.УстановитьПараметр("Проект", Проект);
	Выборка			= Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Результат = Выборка.Исполнитель;
	КонецЕсли; // Если Выборка.Следующий() Тогда	
	Возврат Результат;
КонецФункции // ПолучитьИсполнителей
